celestia-explained.html
<!doctype html>
<html lang="en">
<head>
<title>Celestia Explained</title>
<!-- 2024-11-21 Thu 12:12 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Pietro Visconti">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. What is Celestia?</a></li>
<li><a href="#sec-2">2. What is data availability?</a></li>
<li><a href="#sec-3">3. What&rsquo;s data availability sampling?</a></li>
<li><a href="#sec-4">4. And what is a modular blockchain?</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Celestia Explained</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> What is Celestia?</h2>
<div class="outline-text-2" id="text-1">
<p>
Celestia is a <b>modular data availability (DA) network</b> that securely scales with
the number of users, making it easy for anyone to launch their own blockchain.
</p>

<p>
And by making the blockchain stack modular, anyone can launch their own
blockchain without needing a validator set.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> What is data availability?</h2>
<div class="outline-text-2" id="text-2">
<p>
Usually, Users of a monolithic blockchain usually download all the data to check
that it is available.
</p>

<p>
As blocks get bigger, it becomes impractical for normal users to download all
the data meaning that they can’t verify the chain. Modular chains solve this
problem by making it possible for users to verify very large blocks using a
technology called <b>data availability sampling</b>.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> What&rsquo;s data availability sampling?</h2>
<div class="outline-text-2" id="text-3">
<p>
Data availability sampling (DAS) is the new primitive that <b>enables Celestia
light nodes to verify DA efficiently</b>. Instead of downloading all data, <b>light
nodes only download a tiny portion of each block</b>.
</p>

<p>
Importantly, DAS allows Celestia to scale with the number of users (light
nodes). So, <b>as the light node network grows</b> <b>over time, Celestia can scale to
the data throughput needed</b> for millions of rollups without compromising on
security for end users.
</p>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> And what is a modular blockchain?</h2>
<div class="outline-text-2" id="text-4">
<p>
Modular blockchains are a new paradigm in blockchain design. Instead of one
blockchain doing everything, modular blockchains specialize and optimize to
perform a given function. This specialization provides breakthroughs in
scalability, flexibility, and interoperability, enabling developers to build
blockchain applications for mass adoption.
</p>

<p>
The modules of Celestia (and other modular blockchain) are:
</p>
<ol class="org-ol">
<li>Execution
</li>
<li>Settlement
</li>
<li>Consensus (Proof of Stake)
</li>
<li>Data availability
</li>
</ol>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Pietro Visconti</p>
<p class="date">Created: 2024-11-21 Thu 12:12</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 29.1 (<a href="http://orgmode.org">Org-mode</a> 9.8)</p>
</div>
</footer>
</body>
</html>
